/*
 *202606-2机器人宿管指南

题目背景
众所周知，西西艾弗岛上的机器人喜欢吃苹果。

题目描述
管理员小 P 会定期向机器人宿舍投放苹果。已知初始（第 0 天）有 n 个苹果。从第 1 天起，每天按如下流程进行：
· 根据经验，每天约有 k% 的苹果会变质。若前一天剩余 t 个苹果，则可近似认为有 ⌈tk/100⌉ 个会变坏（其中 ⌈…⌉ 表示向上取整）。
· 丢弃所有坏苹果后，每个机器人会食用一个苹果。
显然，宿舍中如果入住过多机器人，每次投放的 n 个苹果可能很快就被吃光了。小 P 希望这些苹果至少够机器人们吃 m 天，试计算宿舍中最多可以入住多少机器人。
注：“至少够吃 m 天”意味着当第 m 天每个机器人都食用一个苹果后，剩余苹果数量大于或等于零；剩余苹果是否还够第 m+1 天食用则与本题无关。

输入格式
从标准输入读入数据。
输入仅一行，包含空格分隔的三个正整数 n、k 和 m，分别表示初始苹果数量、每日损耗比例和食用天数。

输出格式
输出到标准输出。
输出一个正整数，表示宿舍中最多可入住机器人数量。

样例1输入
1000 1 5

样例1输出
194

样例1解释
当宿舍中入住 194 个机器人时，每日消耗苹果数量如下表所示：
苹果数量	第0天	第1天	第2天	第3天	第4天	第5天
变质	10	8	6	4	2	
食用	194	194	194	194	194	
剩余	1000	796	594	394	196	0
此时，第 5 天恰好吃完所有苹果。
如果入住 195 个机器人，则消耗情况如下表所示：
苹果数量	第0天	第1天	第2天	第3天	第4天	第5天
变质	10	8	6	4	2	
食用	195	195	195	195	<195	
剩余	1000	795	592	391	192	
此时，第 5 天可食用苹果数量不足。

样例2输入
19 5 3

样例2输出
5

样例2解释
如果入住 5 个机器人，则第 3 天结束时剩余 1 个苹果。

子任务
80% 的测试数据满足：n ≤ 10^4；
全部的测试数据满足：1 ≤ n ≤ 10^18、1 ≤ k ≤ 5、1 ≤ m ≤ 2000 且答案为不大于 10^9 的正整数。

提示
最后 20% 测试数据中 n 的取值较大，注意使用合理方式处理。

1人正在看
 * */
