/*
202606-5绝世好串

题目描述

西西艾弗岛上某实验室设计了一套包含 n 个字符的字符集，字符从 1 到 n 编号。本题中，我们无需关心这些字符具体是什么，只需用整数编号对其进行指代即可。

现有一棵 n(n > 1) 个节点的简单树，每个节点有一个字符串。初始时，第 i(1 ≤ i ≤ n) 个节点的字符串只包含一个编号为 i 的字符，也就是说 n 个节点的所有字符构成了字符集 {1, 2, ..., n}。

你可以对某一个节点进行一次「聚拢」操作：

· 将这个节点的字符串，和所有与它相邻节点的字符串一起进行重排（可以任意决定这些字符的拼接顺序），重排后合并成一个字符串，作为这个节点的新字符串；所有与它相邻节点的字符串均被清空为空串。

你可以执行任意次操作，但是必须保证：

· 除了第一次操作，每次操作参与的字符串（在执行聚拢操作的节点或邻域节点上的字符串）中一定有一个字符串长度 ≥ 2。

你需要最后将树上所有字符合并到一个字符串里，作为最终串。
求能够得到的字典序最小的最终串。

输入格式

从标准输入读入数据。
第一行包含一个正整数 n，表示树上的点数。
接下来 n-1 行，每行包含两个正整数 u, v，表示树上的一条边。

输出格式

输出到标准输出。
输出一行 n 个由空格分隔的整数，表示字典序最小的最终字符串。

样例1输入

7
3 5
5 7
3 1
2 5
3 4
6 4

样例1输出

1 2 3 5 7 4 6

样例1解释

样例对应的树结构为：

```text
    5 --- 3 --- 1
   / \     |     |
  7   2    4     6
```

可通过以下 3 次合法的「聚拢」操作得到字典序最小的最终串：

1. 对节点 5 操作：合并 2, 3, 5, 7 号点的字符，按升序拼接得 2 3 5 7。此时全树仅有一个串长度 ≥ 2。（其余参与点均清空，下同）
2. 对节点 3 操作：合并 1, 3, 4, 5 号点。拼接顺序为 s1 + s5 + s4，得到 1 2 3 5 7 4。
3. 对节点 4 操作：合并 3, 4, 6 号点。拼接顺序为 s3 + s6，得到 1 2 3 5 7 4 6。
   操作结束后，所有字符成功合并为一个字符串，即为答案。

子任务

本题采用捆绑测试，你只有通过一个子任务中的所有测试点才能得到该子任务的分数。
对于所有测试数据，满足 2 ≤ n ≤ 10^5，保证输入是一棵合法的树。

· 子任务一（20 分）：保证 2 ≤ n ≤ 10。
· 子任务二（20 分）：保证 2 ≤ n ≤ 500。
· 子任务三（20 分）：保证 2 ≤ n ≤ 3000。
· 子任务四（40 分）：保证无特殊限制。

（左下角）1人正在看
*/

#include <bits/stdc++.h>
using namespace std;
int main()
{
	return 0;
}










